#+title: Python Beginner Std

Python is the most popular programming language, also its more than just a programming language that many people started to take interest and have done courses, it is so friendly and as near to our natural language that it is also considered as general purpose programming language for all.

* Beginner's Fun
#+begin_src python :results output drawer
  year = 10
  weeksYear = 52
  weeksDecade = year * weeksYear

  print("The number of weeks in " + str(year) + " year is: " + str(weeksDecade))

#+end_src

#+RESULTS:
:results:
The number of weeks in 10 year is: 520
:end:

** Strip cool output

Lets bring out an user expected output.

#+begin_src python :results output drawer
  name = " This is a phrase. \n\t Run this in python.\nIt has got us covered. "

  fixedName = name.strip()

  print(fixedName)

#+end_src

#+RESULTS:
:results:
This is a phrase. 
	 Run this in python.
It has got us covered.
:end:

** Cutting the edge

Let's see how to remove some unwanted or obvious string, so we save space and let output be minimal.

#+begin_src python :results output drawer
  url = "https://orgmode.org"

  print(url.removeprefix('https://'))
#+end_src

#+RESULTS:
:results:
orgmode.org
:end:

** Comments
#+begin_src python :results output drawer
  # this is the first comment
  spam = 1  # and this is the second comment
	    # ... and now a third!
  text = "Now # This is not a comment because it's inside quotes."

  print(spam)
  print(text)
#+end_src

#+RESULTS:
:results:
1
Now # This is not a comment because it's inside quotes.
:end:

